# Revert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSetting..::..Revert Method
ViewSheetSetting Class See Also
---
Revert the current view sheet set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Revert()
```

Visual Basic
---
```text
Public Sub Revert
```

Visual C++
---
```text
public:
void Revert()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current view sheet set is In-Session. |

# See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace